#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	int x;

	cout << "Введите число треугольников (это будет их же высота!): ";
	cin >> x;

	for (int i = 0; i < x; i++)                  // Строка
	{
		
		for (int f = 0; f < x; f++)              // Число треугольников
		{


			for (int j = 1; j < x - i; j++)          // пробелы ДО
			{
			cout << " ";
		    }

			for (int k = 0; k < i * 2 + 1; k++)      //  рисунок
			{
			cout << "*";
			}

			for (int m = 0; m < x - i; m++)           // пробелы ПОСЛЕ
			{
			cout << " ";
			}
		}
	
		cout << endl;
	
	}



	cout << endl << endl;

	system("pause");

	return 0;
}
